Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresVariables.PourManagementOptionName Field
 The advanced option name for pour management.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string PourManagementOptionName = "XS_ENABLE_POUR_MANAGEMENT"
Public Const PourManagementOptionName As String = "XS_ENABLE_POUR_MANAGEMENT"
Field Value
Type: String
See Also
Reference
TeklaStructuresVariables Class
Tekla.Structures Namespace